export const rmscCodes = [
  "ศวก. 1",
  "ศวก. 1-1",
  "ศวก. 2",
  "ศวก. 3",
  "ศวก. 4",
  "ศวก. 5",
  "ศวก. 6",
  "ศวก. 7",
  "ศวก. 8",
  "ศวก. 9",
  "ศวก. 10",
  "ศวก. 11",
  "ศวก. 11-1",
  "ศวก. 12",
  "ศวก. 12-1"
];

export const convertToRMScNameFormat = (code) => {
  const nameMap = {
    "ศวก. 1": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 1 เชียงใหม่",
    "ศวก. 1-1": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 1/1 เชียงราย",
    "ศวก. 2": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 2 พิษณุโลก",
    "ศวก. 3": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 3 นครสวรรค์",
    "ศวก. 4": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 4 สระบุรี",
    "ศวก. 5": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 5 สมุทรสงคราม",
    "ศวก. 6": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 6 ชลบุรี",
    "ศวก. 7": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 7 ขอนแก่น",
    "ศวก. 8": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 8 อุดรธานี",
    "ศวก. 9": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 9 นครราชสีมา",
    "ศวก. 10": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 10 อุบลราชธานี",
    "ศวก. 11": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 11 สุราษฎร์ธานี",
    "ศวก. 11-1": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 11/1 ภูเก็ต",
    "ศวก. 12": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 12 สงขลา",
    "ศวก. 12-1": "ศูนย์วิทยาศาสตร์การแพทย์ที่ 12/1 ตรัง"
  };
  
  return nameMap[code] || code;
};
